{"config": [{"config": {"nb_row": 200, "input_dtype": "float32", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "convolution2d_1", "nb_col": 3, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "batch_input_shape": [null, 1, 200, 350], "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "th", "strides": [1, 3], "pool_size": [1, 3]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 1, "activation": "linear", "trainable": true, "name": "convolution2d_2", "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "th", "strides": [1, 3], "pool_size": [1, 3]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 1, "activation": "linear", "trainable": true, "name": "convolution2d_3", "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"nb_row": 1, "activation": "linear", "trainable": true, "name": "convolution2d_4", "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"nb_row": 1, "activation": "linear", "trainable": true, "name": "convolution2d_5", "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"nb_row": 1, "activation": "linear", "trainable": true, "name": "convolution2d_6", "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "th", "strides": [1, 3], "pool_size": [1, 3]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dtype": "float32", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "output_dim": 1024, "W_constraint": null, "b_regularizer": null, "input_dim": 8704, "name": "dense_1", "batch_input_shape": [null, 8704], "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"input_dtype": "float32", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "output_dim": 1024, "W_constraint": null, "b_regularizer": null, "input_dim": 1024, "name": "dense_2", "batch_input_shape": [null, 1024], "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"input_dtype": "float32", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "output_dim": 4, "W_constraint": null, "b_regularizer": null, "input_dim": 1024, "name": "dense_3", "batch_input_shape": [null, 1024], "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}], "class_name": "Sequential"}